---
kind: property
id: P:Autodesk.Revit.DB.RenderingSettings.ResolutionTarget
source: html/9264b3cb-72a6-7aeb-b251-d013c8a15a6e.htm
---
# Autodesk.Revit.DB.RenderingSettings.ResolutionTarget Property

The resolution target.

## Syntax (C#)
```csharp
public ResolutionTarget ResolutionTarget { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration